In [2]:
# Q1
import pandas as pd

# open people_1
People1 = pd.read_table('people_1.txt')
People1.head()

,FirstName,LastName,Email,Phone,Address
0,Matthew,Williams,Matthew.Williams@email.com,053-278-8309,No.0532 Williams Lane
1,MATTHEW,WILLIAMS,Matthew.Williams@email.com,0532788309,#0532 Williams Lane
2,MATTHEW,williams,Matthew.Williams@email.com,0532788309,0532 Williams Lane
3,Louise,Rodriguez,Louise.Rodriguez@email.com,553-981-1593,No.5539 Rodriguez Lane
4,Charles,Smith,Charles.Smith@email.com,523-381-5730,No.5233 Smith Lane

In [3]:
# Q1
import pandas as pd

# open people_2
People2 = pd.read_table('people_2.txt')
People2.head()

,FirstName,LastName,Email,Phone,Address
0,Charles,Jackson,Charles.Jackson@email.com,593-500-2937,No.5935 Jackson Lane
1,CHARLES,JACKSON,Charles.Jackson@email.com,5935002937,#5935 Jackson Lane
2,CHARLES,jackson,Charles.Jackson@email.com,5935002937,5935 Jackson Lane
3,Louise,Anderson,Louise.Anderson@email.com,786-790-6529,No.7867 Anderson Lane
4,Sarah,Rodriguez,Sarah.Rodriguez@email.com,844-187-5552,No.8441 Rodriguez Lane

In [8]:
import pandas as pd

#combine 2 files
df= pd.concat ([People1, People2])

NameError: name 'People1' is not defined

In [7]:
df.head ()

,FirstName,LastName,Email,Phone,Address
0,Matthew,Williams,Matthew.Williams@email.com,053-278-8309,No.0532 Williams Lane
1,MATTHEW,WILLIAMS,Matthew.Williams@email.com,0532788309,#0532 Williams Lane
2,MATTHEW,williams,Matthew.Williams@email.com,0532788309,0532 Williams Lane
3,Louise,Rodriguez,Louise.Rodriguez@email.com,553-981-1593,No.5539 Rodriguez Lane
4,Charles,Smith,Charles.Smith@email.com,523-381-5730,No.5233 Smith Lane

In [11]:
#Capitalize Firstname
df['FirstName']= df['FirstName'].str.capitalize()

In [12]:
df.head()

,FirstName,LastName,Email,Phone,Address
0,Matthew,Williams,Matthew.Williams@email.com,053-278-8309,No.0532 Williams Lane
1,Matthew,WILLIAMS,Matthew.Williams@email.com,0532788309,#0532 Williams Lane
2,Matthew,williams,Matthew.Williams@email.com,0532788309,0532 Williams Lane
3,Louise,Rodriguez,Louise.Rodriguez@email.com,553-981-1593,No.5539 Rodriguez Lane
4,Charles,Smith,Charles.Smith@email.com,523-381-5730,No.5233 Smith Lane

In [13]:
#caplitalize Lastname
df['LastName']= df['LastName'].str.capitalize()

In [14]:
df.head()

,FirstName,LastName,Email,Phone,Address
0,Matthew,Williams,Matthew.Williams@email.com,053-278-8309,No.0532 Williams Lane
1,Matthew,Williams,Matthew.Williams@email.com,0532788309,#0532 Williams Lane
2,Matthew,Williams,Matthew.Williams@email.com,0532788309,0532 Williams Lane
3,Louise,Rodriguez,Louise.Rodriguez@email.com,553-981-1593,No.5539 Rodriguez Lane
4,Charles,Smith,Charles.Smith@email.com,523-381-5730,No.5233 Smith Lane

In [6]:
df.head()

NameError: name 'df' is not defined

In [30]:
#formating phonenumber
df['Phone']= df['Phone'].str.replace('-', '')

In [31]:
df.head()

,FirstName,LastName,Email,Phone,Address
0,Matthew,Williams,matthew.williams@email.com,0532788309,0532 Williams Lane
1,Matthew,Williams,matthew.williams@email.com,0532788309,0532 Williams Lane
2,Matthew,Williams,matthew.williams@email.com,0532788309,0532 Williams Lane
3,Louise,Rodriguez,louise.rodriguez@email.com,5539811593,5539 Rodriguez Lane
4,Charles,Smith,charles.smith@email.com,5233815730,5233 Smith Lane

In [9]:
#formating email
df['Email']= df['Email'].str.lower()

NameError: name 'df' is not defined

In [4]:
#formating Address
df['Address']= df['Address'].str.replace('No', '')

NameError: name 'df' is not defined

In [5]:
df.head()

NameError: name 'df' is not defined

In [4]:
import numpy as np
#drop duplicates 
df2 = df.drop_duplicates(inplace=False)
df2.index = np.arange(0, len(df))
df2.head()

NameError: name 'df' is not defined

In [ ]:
# import as CSV
df3.to_csv ('Newfile.csv', index=False)

In [10]:
import json

    #you need to add you path here
    with open('movie.json','r', encoding='utf-8') as f1:
        ll = [json.loads(line.strip()) for line in f1.readlines()]

        #this is the total length size of the json file
        print(len(ll)) #9999 movies

        size_of_the_split=8
        total = len(ll) // size_of_the_split

        #in here you will get the Number of splits
        print(total+1)

        for i in range(total+1):
            json.dump(ll[i * size_of_the_split:(i + 1) * size_of_the_split], open(
                'Json_Split' + str(i+1) + '.json' , 'w',
                encoding='utf8'), ensure_ascii=False, indent=True)

IndentationError: unexpected indent (816051844.py, line 4)